[
    {
        "id": "4488281",
        "title": "Incannex Healthcare shares rise more than 30% on $20M share repurchase program",
        "publishedDate": "2025-08-22 08:12:26",
        "url": "https://seekingalpha.com/news/4488281-incannex-healthcare-shares-rise-more-than-30-on-20m-share-repurchase-program",
        "content": "Incannex Healthcare (NASDAQ:IXHL) said on Friday that its board has authorized a share repurchase program for up to $20M of the company's outstanding shares of common stock. Under the repurchase program, the company may repurchase shares of common stock through open market purchases. The timing and amount of any repurchases will depend on market conditions, available capital resources, and other factors. Incannex Healthcare (NASDAQ:IXHL) shares were up more than 30% in premarket trading. More on Incannex Healthcare Incannex drops despite mid-stage trial win for lead asset in sleep apnoea Historical earnings data for Incannex Healthcare Financial information for Incannex Healthcare"
    },
    {
        "id": "4488279",
        "title": "SharpLink Gaming announces up to $1.5B share buyback program",
        "publishedDate": "2025-08-22 08:11:21",
        "url": "https://seekingalpha.com/news/4488279-sharplink-gaming-announces-up-to-15b-share-buyback-program",
        "content": "Online gaming company SharpLink Gaming (NASDAQ:SBET) announced on Friday an up to $1.5B stock repurchase program.Shares were +5.27% pre-market to $18.99.Repurchases may be made from time to time through open market purchases, privately negotiated transactions, or other means permitted under applicable securities laws.The timing and amount of repurchases will depend on market conditions, share price, trading volume, and other factors. More on SharpLink Gaming SharpLink: Is The Future Tied To Ethereum? SharpLink Gaming, Inc. (SBET) Q2 2025 Earnings Call Transcript SharpLink Gaming: Another Overpriced Ethereum Wrapper SharpLink reports total ETH holdings climb to 740,760 as of Aug 17 SharpLink Gaming reports Q2 results"
    },
    {
        "id": "4488283",
        "title": "MCF Energy launches $500,000 private placement",
        "publishedDate": "2025-08-22 08:09:16",
        "url": "https://seekingalpha.com/news/4488283-mcf-energy-launches-500000-private-placement",
        "content": "MCF Energy (TSXV:MCF:CA) has announced a non-brokered private placement for aggregate minimum gross proceeds of $500,000. The offering will consist of a minimum of 10M units at a price of $0.05 per unit. Each unit will consist of one common share and one full common share purchase warrant, with each warrant entitling the holder to acquire an additional common share at an exercise price of $0.06 for a period of 24 months from the date of issuance. Source: Press Release More on MCF Energy Financial information for MCF Energy Ltd."
    },
    {
        "id": "4488266",
        "title": "JPMorgan Chase to pay Malaysia $330M to settle 1MDB case",
        "publishedDate": "2025-08-22 08:06:24",
        "url": "https://seekingalpha.com/news/4488266-jpmorgan-chase-to-pay-malaysia-330m-to-settle-1mdb-case",
        "content": "JPMorgan Chase (NYSE:JPM) agreed to pay Malaysia 1.4B ringgit ($330M) to settle all claims relating to 1MDB, the sovereign wealth fund that was the focus of one of the world's largest financial frauds, the government of Malaysia said Friday. The settlement will end the U.S. lender's exposure to the scandal that came to light in 2015. In 2020, Goldman Sachs (GS) reached a $3.9B settlement with Malaysia to resolve claims that it misled investors in bond sales that raised $6.5B for the fund. The U.S. Department of Justice has determined that $4.5B was misappropriated from 1MDB. Also on Friday, Switzerland's Attorney General fined the JPMorgan Chase (NYSE:JPM) CHF 3M ($3.7M) for \"failing to take all reasonable and necessary organizational measures\" to prevent money laundering of the funds misappropriated from 1MDB. In 2021, 1MDB sued units of JPMorgan Chase (NYSE:JPM), Deutsche Bank (DB), and Coutts & Co., alleging \"negligence, breach of contract, conspiracy to defraud/injure, and/or dishonest assistance,\" and sought to recover alleged losses. Under the Malaysian agreement, JPMorgan (JPM) will, \"without admission of liability,\" pay the amount to Malaysia's Assets Recovery Trust Account. A JPMorgan spokesman commented, \"We appreciate the collaboration with the Malaysian Government in resolving past matters related to 1MDB, which have been thoroughly reviewed. Since then, we’ve enhanced our controls, earning the trust of regulators in Switzerland and beyond. We are pleased to have these matters resolved and remain focused on delivering exceptional service to our clients.\" Billions of dollars were funneled out of 1MDB starting in 2009, until the scandal was reported in 2015. More on JPMorgan Chase JPMorgan: Life's Good At The Top JPMorgan: Set To Win Big From Goldman's Apple Card Divestiture JPMorgan Chase's Newest 6% Bond Appears Better Than CDs Or Treasuries State Street joins JPMorgan's blockchain debt platform as first third-party custodian JPMorgan Chase, Mitsubishi UFJ near $22B deal to finance data mega-campus in Texas - report"
    },
    {
        "id": "4488280",
        "title": "Cineplex renews share buyback program",
        "publishedDate": "2025-08-22 08:05:00",
        "url": "https://seekingalpha.com/news/4488280-cineplex-renews-share-buyback-program",
        "content": "Cineplex (TSX:CGX:CA) has received TSX approval to renew its normal course issuer bid (NCIB). The company may repurchase up to 6.29M common shares, representing 10% of its public float. As of August 14, 2025, Cineplex had 63.44M total shares outstanding."
    },
    {
        "id": "4488269",
        "title": "Air Liquide to buy South Korea's DIG Airgas in $3.3B deal",
        "publishedDate": "2025-08-22 08:02:57",
        "url": "https://seekingalpha.com/news/4488269-air-liquide-to-buy-south-koreas-dig-airgas-in-3_3b-deal",
        "content": "Cineberg/iStock Editorial via Getty ImagesAir Liquide (OTCPK:AIQUF) (OTCPK:AIQUY) said Friday it agreed to acquire South Korea's DIG Airgas from Macquarie Asia-Pacific Infrastructure Fund 2 for €2.85B (~$3.3B) including debt. The French company said the acquisition would strengthen its position in South Korea, the world’s fourth"
    },
    {
        "id": "4488277",
        "title": "Sands China plans to host pre-season NBA games amid push to boost the sports scene in Macau",
        "publishedDate": "2025-08-22 08:02:05",
        "url": "https://seekingalpha.com/news/4488277-sands-china-plans-to-host-pre-season-nba-games-amid-push-to-boost-the-sports-scene-in-macau",
        "content": "Dave Primov/iStock Editorial via Getty ImagesSands China (OTCPK:SCHYY) (OTCPK:SCHYF) is ushering in a new era for Macau by partnering with the National Basketball Association to host the NBA China Games 2025, marking a milestone for sports-driven tourism and regional economic diversification. The multi-year collaboration will kick off with the Brooklyn Nets and Phoenix Suns playing preseason games at The Venetian Arena on October 10 and 12. \"Bringing preseason games to Macao will showcase the excitement of the NBA to fans in one of the world’s emerging hubs for sports,\" stated NBA Deputy Commissioner and Chief Operating Officer Mark Tatum. The initiative is part of Sands China's (OTCPK:SCHYY) (OTCPK:SCHYF) strategic push to expand its entertainment portfolio beyond gaming, supporting the city’s goal to have non-gaming industries contribute 60% of GDP by 2028. Supporting this, NBA-related infrastructure and fan experiences are a major focus, highlighted by the opening of an NBA Flagship Store at The Londoner Macao. Alongside the games, Sands China (OTCPK:SCHYY) (OTCPK:SCHYF) and the NBA will host interactive fan activities, including an NBA Fan Day on October 11, where fans can join basketball-themed contests and enjoy celebrity performances. Stars like Shaquille O'Neal and local influencers are scheduled to participate. Marketing partners such as Taobao (BABA), Ant International, Nike (NKE), and Tissot are supporting the initiative. Sands China (OTCPK:SCHYY) (OTCPK:SCHYF) has a connection to the NBA through Patrick Dumont, who is the Las Vegas Sands (NYSE:LVS) President and Chief Operating Officer and Dallas Mavericks governor and majority owner. More on Las Vegas Sands and Sands China Las Vegas Sands: Q2 Results Move It To Center Stage Las Vegas Sands: Growth In Asia And Strong Margins Overshadowed By Leverage Risk Las Vegas Sands Corp. 2025 Q2 - Results - Earnings Call Presentation Macau gaming revenue smashes expectations and rises to a new post-pandemic high Las Vegas Sands declares $0.25 dividend"
    },
    {
        "id": "4488273",
        "title": "DeFi Technologies to launch normal course issuer bid",
        "publishedDate": "2025-08-22 07:53:36",
        "url": "https://seekingalpha.com/news/4488273-defi-technologies-to-launch-normal-course-issuer-bid",
        "content": "Olemedia/E+ via Getty ImagesFinancial technology company DeFi Technologies (NASDAQ:DEFT) announced on Friday an intent to commence a normal course issuer bid. Shares were +3.81% pre-market to $2.18. The company plans to buy back shares of common stock with cash on hand through the facilities of Nasdaq Capital Markets, CBOE Canada, and/or other Canadian alternative trading platforms. The current cash balance is ~$19.8M. The buyback program will begin on August 26, 2025, and is expected to run through August 26, 2026. Purchase price shall be the prevailing market price, and all shares repurchased will be canceled. The actual number of shares purchased and the exact timing of such purchases will be determined by the company. DeFi Technologies may not purchase any number of shares exceeding 10% of the public float as of August 18, or 31.67M shares, in aggregate. More on DeFi Technologies Inc. Financial information for DeFi Technologies Inc."
    },
    {
        "id": "4488221",
        "title": "European indexes cautious as markets digest EU-U.S. trade deal",
        "publishedDate": "2025-08-22 07:40:23",
        "url": "https://seekingalpha.com/news/4488221-european-indexes-cautious-as-markets-digest-eu-us-trade-deal",
        "content": ""
    },
    {
        "id": "4488271",
        "title": "Restaurant rivals take on Starbucks during Pumpkin Spice Latte season",
        "publishedDate": "2025-08-22 07:33:26",
        "url": "https://seekingalpha.com/news/4488271-restaurant-rivals-take-on-starbucks-during-pumpkin-spice-latte-season",
        "content": "Starbucks (NASDAQ:SBUX) will bring back the Pumpkin Spice Latte on August 26. The date marks the return of the coffee chain's full fall menu, which will also include seasonal favorites like the Pumpkin Cream Cold Brew, Iced Pumpkin Cream Chai, and Pecan Crunch Oatmilk Latte. At-home PSL-inspired products are already available in grocery stores. The PSL release comes just before the start of the fall season and continues the tradition of introducing the phenomenon in late August each year. As usual, restaurant rivals are not standing down in battling Starbucks (NASDAQ:SBUX) during pumpkin drink season. McDonald's (NYSE:MCD) plans to bring McCafé Pumpkin Spice Latte (hot or iced) back on August 29. Dunkin' is bringing Pumpkin Spice Latte (hot and iced), Pumpkin Cake Donuts and Pumpkin Munchkins Donut Holes, and Iced Pumpkin Loaf (pumpkin and vanilla cake with cream cheese icing) back in late August. Dutch Bros. (NYSE:BROS) said it is channeling flannel this fall with the return of Caramel Pumpkin Brûlée and Cookie Butter Latte. The fall flavors are available starting August 22 at all +1,000+ Dutch Bros (NYSE:BROS) locations, while supplies last. In addition, Tim Hortons (NYSE:QSR) relaunched its pumpkin spice beverage lineup, including Pumpkin Spice Latte, Pumpkin Spice Iced Capp, and Pumpkin Spice Cold Brew. Some locations are promoting a giveaway with every pumpkin drink purchase. More on Starbucks Starbucks And McDonald's: Fast Food Giant Better Positioned Amid China Challenges Starbucks Stock Is Too Pricey For Its Performance: Time To Exit Starbucks: Buy Before Green Apron Gains Traction Starbucks seeks non-binding bids for China unit within two weeks - report Starbucks testing healthier coconut-infused cold beverages"
    },
    {
        "id": "4488270",
        "title": "Portman Ridge's name change to BCP Investment effective after market close today",
        "publishedDate": "2025-08-22 07:29:16",
        "url": "https://seekingalpha.com/news/4488270-portman-ridges-name-change-to-bcp-investment-effective-after-market-close-today",
        "content": "Investment company Portman Ridge Finance (NASDAQ:PTMN) said in an SEC filing on Thursday that its name change to BCP Investment is effective after market close on Friday, August 22. On August 25, the company's shares of common stock will cease to trade under the ticker PTMN, and commence trading as BCIC. PTMN had disclosed the name and ticker change plans, connected to its merger with Logan Ridge Finance (LRFC), on June 17. More on Portman Ridge Finance Portman Ridge Finance Corporation (PTMN) Q2 2025 Earnings Call Transcript Portman Ridge Finance: Two Wrongs Don't Make A Right Portman Ridge Finance: Q1 Earnings Reveal More Downside Risks Portman Ridge Finance reports Q2 results Logan Ridge obtains shareholder approval for acquisition by Portman Ridge Finance"
    },
    {
        "id": "4488264",
        "title": "Biohaven rises as FDA cancels AdCom on lead drug",
        "publishedDate": "2025-08-22 07:26:16",
        "url": "https://seekingalpha.com/news/4488264-biohaven-rises-fda-cancels-adcom-lead-drug",
        "content": "JHVEPhotoBiohaven (NYSE:BHVN) shares spiked in the premarket on Friday after the FDA revoked an advisory committee meeting scheduled in connection with its marketing application for lead drug troriluzole. Early this year, the New Haven, Connecticut-based biotech received the FDA’s priority review for its new drug application (NDA) for troriluzole targeted at spinocerebellar ataxia, a group of rare neurodegenerative disorders. In May, the FDA’s Office of Neuroscience extended its review period to evaluate additional submissions made by the company in response to the agency’s requests and decided to hold an advisory committee meeting to discuss the NDA. In an SEC filing on Friday, the company noted that the FDA informed it on Aug. 21 that an AdCom meeting is no longer required for the review. Biohaven (NYSE:BHVN), a spinout of Biohaven Pharmaceutical formed when Pfizer (PFE) acquired the migraine therapy maker in 2022, continues to expect a decision on the NDA in Q4 2025. More on Biohaven Biohaven: Cash Hog Awaits FDA Decision On SCA Biohaven says anti-cancer agent cut tumor size with Regeneron’s Libtayo in Phase 1 trial Seeking Alpha’s Quant Rating on Biohaven Historical earnings data for Biohaven Financial information for Biohaven"
    },
    {
        "id": "4488267",
        "title": "Workday's worries persist as results and guidance show 'growth engine is stuck'",
        "publishedDate": "2025-08-22 07:25:41",
        "url": "https://seekingalpha.com/news/4488267-workdays-worries-persist-as-results-and-guidance-show-growth-engine-is-stuck",
        "content": "JHVEPhotoEven as Workday's (NASDAQ:WDAY) fiscal second-quarter results and guidance topped estimates, concerns over artificial intelligence and organic growth persist for the back-office software provider, Wall Street analysts said. Shares fell 5% in premarket trading on Friday, reversing an initial gain. “While profitability and AI momentum continue to be encouraging positives, a decelerating [current remaining performance obligations] growth rate and an unchanged organic FY25 subscription revenue guide leave open the durability of growth question,” Morgan Stanley analyst Keith Weiss wrote in a note to clients. “While non-GAAP multiples look undemanding, the lack of a floor on growth keeps us [Equal-Weight].” Weiss, who has a $255 price target on the stock, added that the company's growth rate is looking similar to Salesforce (CRM) and ADBE (ADBE): “a seemingly inexpensive non-GAAP EPS multiple (23X CY26) multiple may begin to look more daunting if investors begin to consider stock-based compensation, as the GAAP EPS multiple tops 80X.” J.P. Morgan analyst Mark Murphy was a tad more positive, but noted there were “puts and takes” on the guidance. “While FQ2 backlog and P&L results came in above consensus, which is important, we believe investors may be somewhat disheartened guidance was reaffirmed rather than raised in organic terms, as the higher FY26E revenue guidance is driven by the Paradox acquisition and Workday is still 'keeping an eye' on headwinds relating to SLED, a topic we had noted in our preview,” Murphy wrote. “Overall, despite some puts and takes, we remain constructive on the supportive vectors, including full-suite, partner-led sales, mid-market penetration, and emerging AI momentum, which should manifest into relatively stable growth trends aside ongoing margin progress.” Jefferies analyst Brent Thill said he saw some concerns about AI, but the company still has a “sticky nature” and there is the potential for margin upside. “While the stock continues to lack a near-term catalyst, we remain Buy-rated due to consistent execution amid increasing uncertainties and a sizable margin opportunity (high 20s lag peers in the low 40s),” Thill wrote in a note. More on Workday Workday, Inc. 2026 Q2 - Results - Earnings Call Presentation Workday, Inc. (WDAY) Q2 2026 Earnings Conference Call Transcript Workday Earnings: Focus On What Really Matters Biggest stock movers Friday: ZM, NIO, and more Workday raises FY26 subscription revenue guidance to $8.815B while expanding AI suite and partner ecosystem"
    },
    {
        "id": "4488223",
        "title": "Nasdaq, S&P, Dow futures rise ahead of Powell's speech at Jackson Hole",
        "publishedDate": "2025-08-22 07:14:51",
        "url": "https://seekingalpha.com/news/4488223-sp500-nasdaq-dow-jones-outlook-powell",
        "content": "P_Wei/E+ via Getty ImagesStock index futures showed little movement on Friday as investors awaited Federal Reserve Chair Jerome Powell's speech at Jackson Hole. S&P 500 futures (SPX) were unchanged, Nasdaq 100 futures (US100:IND) +0.1%, and Dow futures (INDU) +0.2%. The 10-year Treasury yield ("
    },
    {
        "id": "4488261",
        "title": "BJ's Wholesale Club says it is on solid footing for the back half of the year",
        "publishedDate": "2025-08-22 07:13:45",
        "url": "https://seekingalpha.com/news/4488261-bjs-wholesale-club-says-it-is-on-solid-footing-for-the-back-half-of-the-year",
        "content": "StevenStarr73BJ's Wholesale Club Holdings (NYSE:BJ) traded slightly lower in early action on Friday after the warehouse club chain posted a mixed Q2 earnings report. Total comparable club sales decreased by 0.3% during the quarter due to declining retail prices of fuel. Excluding the impact of gasoline sales, comparable club sales increased by 2.3%. Top-line revenue of $5.38 billion fell short of the consensus estimate by $100 million. Membership fee income increased 9.0% year-over-year to $123.3 million in Q2. The increase was primarily driven by strength in membership acquisition, retention, and higher-tier membership penetration across both new and existing clubs, as well as the increase in annual membership fees, which became effective in January 2025. Merchandise gross margin rate increased by 20 basis points compared to the first six months of fiscal 2024. The company noted that it continues to manage the business to drive profitable growth across the broader merchandise assortment. Operating income was up 6.3% to $216.5 million. Non-GAAP EPS was reported at $1.14 vs. $1.09 consensus and $1.09 a year ago. Adjusted EBITDA rose 8.0% to $303.9 million. \"Our business model continues to perform and build upon momentum, as we grow membership and gain market share even in a dynamic environment. We enter the back half of the year on solid footing and confident in our ability to deliver strong results,\" stated CEO Bob Eddy. Looking ahead, BJ's (NYSE:BJ) sees comparable club sales, excluding the impact of gasoline sales, increasing 2.0% to 3.5% year-over-year for the full year. Adjusted EPS is seen landing in a range from $4.20 to $4.35 (midpoint $4.275) vs. $4.30 consensus. Shares of BJ's (BJ) slipped 0.5% in premarket trading to $106.00 vs. the 52-week range of $76.33 to $121.10. The warehouse club stock is still up more than 18% on a year-to-date basis. More on BJ’s Wholesale Club BJ's Wholesale Club Holdings: Positive Earnings Growth Outlook (Rating Upgrade) BJ’s Wholesale Club reports mixed Q2 results; updates FY25 outlook BJ’s Wholesale Club Q2 2026 Earnings Preview Seeking Alpha’s Quant Rating on BJ’s Wholesale Club Historical earnings data for BJ’s Wholesale Club"
    },
    {
        "id": "4488268",
        "title": "Ubiquiti Non-GAAP EPS of $3.54 beats by $1.31, revenue of $759.2M beats by $124M",
        "publishedDate": "2025-08-22 07:10:34",
        "url": "https://seekingalpha.com/news/4488268-ubiquiti-non-gaap-eps-of-354-beats-by-131-revenue-of-7592m-beats-by-124m",
        "content": "Ubiquiti press release (NYSE:UI): Q4 Non-GAAP EPS of $3.54 beats by $1.31. Revenue of $759.2M (+49.6% Y/Y) beats by $124M. More on Ubiquiti Ubiquiti: Priced With Too Ambitious Expectations (Rating Downgrade) Seeking Alpha’s Quant Rating on Ubiquiti Historical earnings data for Ubiquiti Dividend scorecard for Ubiquiti Financial information for Ubiquiti"
    },
    {
        "id": "4488265",
        "title": "Ubiquiti raises dividend by 33.3% to $0.80 a share; announces new stock repurchase up to $500M",
        "publishedDate": "2025-08-22 07:07:38",
        "url": "https://seekingalpha.com/news/4488265-ubiquiti-raises-dividend-by-333-to-080-a-share-announces-new-stock-repurchase-up-to-500m",
        "content": "Ubiquiti (NYSE:UI) declares $0.80/share quarterly dividend, 33.3% increase from prior dividend of $0.60. Forward yield 0.82% Payable Sept. 8; to shareholders of record Sept. 2; ex-div Sept. 2. The company has initiated a new stock repurchase program authorizing the company to repurchase up to $500 million of its common stock, as disclosed in the Form 8-K filed on August 22, 2025. See UI Dividend Scorecard, Yield Chart, & Dividend Growth. More on Ubiquiti Ubiquiti: Priced With Too Ambitious Expectations (Rating Downgrade) Seeking Alpha’s Quant Rating on Ubiquiti Historical earnings data for Ubiquiti Dividend scorecard for Ubiquiti Financial information for Ubiquiti"
    },
    {
        "id": "4488255",
        "title": "Cenovus Energy to buy MEG Energy in C$7.9B deal, topping Strathcona bid",
        "publishedDate": "2025-08-22 07:07:36",
        "url": "https://seekingalpha.com/news/4488255-cenovus-energy-to-buy-meg-energy-in-c79b-deal-topping-strathcona-bid",
        "content": ""
    },
    {
        "id": "4488263",
        "title": "Waste Management declares $0.825 dividend",
        "publishedDate": "2025-08-22 07:04:27",
        "url": "https://seekingalpha.com/news/4488263-waste-management-declares-0825-dividend",
        "content": "Waste Management (NYSE:WM) declares $0.825/share quarterly dividend, in line with previous. Forward yield 1.44% Payable Sept. 26; to shareholders of record Sept. 12; ex-div Sept. 12. The company has now announced a dividend of $0.825 for three consecutive quarters. See WM Dividend Scorecard, Yield Chart, & Dividend Growth. More on Waste Management Waste Management: An Overvalued Giant (Ratings Downgrade) Waste Management: It's Not Too Late To Buy This Waste Management Q2: Expanding Into Healthcare And Renewable Energy, Initiate At Buy Waste Management appoints David Reed as CFO Waste Management raises 2025 free cash flow guidance to $2.8B–$2.9B as margin expansion accelerates"
    },
    {
        "id": "4488262",
        "title": "Buckle GAAP EPS of $0.89 beats by $0.06, revenue of $305.7M beats by $13.09M",
        "publishedDate": "2025-08-22 07:00:10",
        "url": "https://seekingalpha.com/news/4488262-buckle-gaap-eps-of-089-beats-by-006-revenue-of-3057m-beats-by-1309m",
        "content": "Buckle press release (NYSE:BKE): Q2 GAAP EPS of $0.89 beats by $0.06. Revenue of $305.7M (+8.3% Y/Y) beats by $13.09M. Comparable store net sales for the 13-week fiscal quarter ended August 2, 2025, increased 7.3 percent from comparable store net sales for"
    },
    {
        "id": "4488258",
        "title": "Personalis gains as VA awards work order worth up to $13.5M",
        "publishedDate": "2025-08-22 06:59:18",
        "url": "https://seekingalpha.com/news/4488258-personalis-stock-gains-va-work-order",
        "content": "Kiyoshi TannoShares of Personalis (NASDAQ:PSNL) added ~5% in the premarket on Friday after the cancer test maker announced that it received a new task order worth up to $13.5M under a contract with the Department of Veterans Affairs. The maker of the NeXT Personal cancer test offers genome sequencing services as part of a contract with the Department of Veterans Affairs Million Veteran Program (VA MVP), a large-scale population sequencing initiative. The new task order, offered under the VA MVP program, takes effect on September 30, 2025, subject to the receipt of samples and the fulfillment of services by the company, Personalis (NASDAQ:PSNL) said in a regulatory filing on Friday. To date, the company has received nearly $225 million in task orders under its contracts with the VA MVP, which accounted for 9% of its topline in 2024 and 13% in 2023, respectively. More on Personalis Personalis, Inc. (PSNL) Q2 2025 Earnings Call Transcript Personalis: Ultra-Sensitive Tech, Ultra-Sensitive Risks Personalis outlines $70M–$80M revenue target for 2025 amid 59% sequential clinical test growth and revised biopharma outlook Personalis GAAP EPS of -$0.23 beats by $0.01, revenue of $17.2M misses by $2.91M Seeking Alpha’s Quant Rating on Personalis"
    },
    {
        "id": "4488256",
        "title": "Hyperscale Data reaffirms 2025 guidance, citing Gresham Worldwide's emergence",
        "publishedDate": "2025-08-22 06:53:26",
        "url": "https://seekingalpha.com/news/4488256-hyperscale-data-reaffirms-2025-guidance-citing-gresham-worldwides-emergence",
        "content": "Hyperscale Data (NYSE:GPUS) has reconfirmed its revenue guidance for 2025, projecting earnings between $125 million and $135 million, following the final court approval of the Chapter 11 reorganization plan for its defense affiliate, Gresham Worldwide. As a result, Gresham is expected to emerge on October 1, 2025, at which point it will reconsolidate as a subsidiary of Hyperscale Data, contributing an estimated $40 million in annualized revenue. Furthermore, Hyperscale Data expects strong growth from Gresham Worldwide and its high-margin software platforms, including blockchain infrastructure and tokenization solutions. \"The court's approval of Gresham Worldwide's reorganization plan provides additional visibility into the contribution we expect from this business beginning in the fourth quarter, while our software initiatives remain on track to drive scalable, recurring revenue,\" said William B. Horne, CEO of Hyperscale Data. More on Hyperscale Data Hyperscale Data reduces debt by over $20 million $PEPE meme coin to be accepted as crypto payment on Bitnile.com social casino Financial information for Hyperscale Data"
    },
    {
        "id": "4488259",
        "title": "Fortinet boosts share repurchase program by $1B",
        "publishedDate": "2025-08-22 06:53:06",
        "url": "https://seekingalpha.com/news/4488259-fortinet-boosts-share-repurchase-program-by-1b",
        "content": "Fortinet (NASDAQ:FTNT) has increased its share repurchase program by $1 billion, bringing its aggregate authorized repurchase amount to up to $9.25B. The program was also extended through February 28, 2027. As of August 21, 2025, approximately $1.23B remained available under the existing program, including the $1B increase. More on Fortinet Fortinet: Thesis Breakage Or Market Exaggeration? Fortinet: -24% After Earnings Makes This A Great Long-Term Opportunity Fortinet: Strong ARR And Billings Acceleration Support FY25 Growth Story Notable analyst calls this week: Spotify, Fox and Caterpillar among top picks Fortinet receives swath of downgrades on firewall refresh 'revelation'"
    },
    {
        "id": "4488257",
        "title": "Bally's lands key regulatory approvals related to the Intralot S.A. deal",
        "publishedDate": "2025-08-22 06:49:34",
        "url": "https://seekingalpha.com/news/4488257-ballys-lands-key-regulatory-approvals-related-to-the-intralot-sa-deal",
        "content": "Nisian Hughes/DigitalVision via Getty ImagesBally's Corporation (NYSE:BALY) updated investors on the progress on its previously disclosed transaction agreement with Intralot S.A. (OTCPK:IRLTF) (OTC:IRLTY). Under the terms of the deal, Intralot (OTCPK:IRLTF) (OTC:IRLTY) is set to acquire all issued and outstanding capital stock of Bally's (NYSE:BALY) Holdings Limited. That subsidiary holds Bally's (BALY) international interactive business. The expected closing of the transaction in Q4 will result in Bally’s (BALY) becoming the majority shareholder of Intralot. The deal is structured so that while Intralot takes direct ownership of the international interactive assets, control of the combined global entity shifts to Bally's (BALY), meaning it will have influence over Intralot's broader operations. On August 14, Bally's (BALY) received notifications from the Gambling Commission of Great Britain confirming that, contingent on routine ongoing requirements, its UK licenses (held by Gamesys Limited, Bally’s (Newcastle) Limited, and Gamesys Operations Limited) will remain in effect after the transaction closes. The regulatory approval addresses a critical hurdle and clears a path for finalizing the transaction. The deal with Intralot (OTCPK:IRLTF) (OTC:IRLTY) is seen by analysts as transformative for Bally's (BALY) which has been repositioning itself as a global digital gaming and interactive entertainment player. By integrating with Intralot’s established international operations and technology, Bally’s (BALY) expects to broaden its global reach and strengthen its digital platform, especially in regulated European and emerging markets. Intralot (OTCPK:IRLTF) (OTC:IRLTY) is a Greek-based, publicly listed global gaming technology company that provides gambling systems, sports betting management, interactive gaming services, and omnichannel lottery solutions to state-licensed operators in over 39 countries. The company is best known for lottery modernization, digital transformation, and responsible gaming. Shares of Bally's (BALY) were down 1.6% in premarket trading on Friday. More on Bally's Corporation Bally's Corp: BALY's Debt Rallied, We Increased Our Position Bally's: Now They Have A Bull Thesis, But I Still Don't Buy It Bally's points to progress with its Chicago casino and Bronx bid Bally's Corporation reports Q2 results Historical earnings data for Bally's Corporation"
    },
    {
        "id": "4488260",
        "title": "BJ’s Wholesale Club reports mixed Q2 results; updates FY25 outlook",
        "publishedDate": "2025-08-22 06:49:04",
        "url": "https://seekingalpha.com/news/4488260-bjs-wholesale-club-reports-mixed-q2-results-updates-fy25-outlook",
        "content": "BJ’s Wholesale Club press release (NYSE:BJ): Q2 Non-GAAP EPS of $1.14 beats by $0.05. Revenue of $5.38B (+3.3% Y/Y) misses by $100M. Comparable club sales decreased by 0.3% year-over-year due to declining retail prices of fuel. Comparable club sales, excluding gasoline sales, increased by 2.3% year-over-year, led by traffic growth. Membership fee income increased by 9.0% year-over-year to $123.3 million. Member count grew to a record 8 million members. Digitally enabled comparable sales growth was 34%, reflecting two-year stacked comp growth of 56%. The Company provided an updated outlook for fiscal 2025: Comparable club sales, excluding the impact of gasoline sales, to increase 2.0% to 3.5% year-over-year Adjusted EPS to range from $4.20 to $4.35 (prior $4.10 to $4.30) vs $4.31 consensus. Capital expenditures of approximately $800 million More on BJ’s Wholesale Club BJ's Wholesale Club Holdings: Positive Earnings Growth Outlook (Rating Upgrade) BJ’s Wholesale Club Q2 2026 Earnings Preview BJ's Wholesale Club is tipped by Evercore ISI for a post-earnings rally this week Seeking Alpha’s Quant Rating on BJ’s Wholesale Club Historical earnings data for BJ’s Wholesale Club"
    },
    {
        "id": "4487968",
        "title": "Self-driving tech company Nuro reels in Nvidia and Uber as strategic investors",
        "publishedDate": "2025-08-22 06:30:22",
        "url": "https://seekingalpha.com/news/4487968-self-driving-tech-company-nuro-reels-in-nvidia-and-uber-as-strategic-investors",
        "content": ""
    },
    {
        "id": "4488230",
        "title": "Fed's Powell at Jackson Hole: Here's what to watch",
        "publishedDate": "2025-08-22 06:27:04",
        "url": "https://seekingalpha.com/news/4488230-feds-powell-at-jackson-hole-heres-what-to-watch",
        "content": "Gary YeowellInvestors today are looking to Wyoming, and it's not to book a national park getaway before the summer comes to an end. The annual Jackson Hole Economic Policy Symposium hosted by the Kansas City Fed is underway, with Chairman Jerome Powell set to take the stage at 10:00 AM ET. The theme of the 2025 conference is titled \"Labor Markets in Transition: Demographics, Productivity, and Macroeconomic Policy,\" which will come at a time when labor market indicators are being challenged and questions swirl over real-time economic data. Snapshot: The recent massive revision to nonfarm payroll numbers not only made waves after President Trump ousted the head of the Bureau of Labor Statistics, but also sent policymakers scrambling to make sense of the new numbers. The 258K jobs that were previously thought to have been added in May and June were actually non-existent, meaning the U.S. only added 19,000 and 14,000 jobs for those two months, respectively. Another weak NFP gain of 73K was later recorded in July, indicating a broad slowdown in job growth for the overall labor market. Typically, that would have seriously worried many Fed officials (and some are), but others are still debating root causes to determine the path forward for monetary policy. If the underlying reasons are linked to Trump's immigration policies and baby boomer retirement, it might not warrant a strong shift in monetary policy since the downturn is based on labor supply. However, if hiring fundamentals are no longer intact, it could require a bigger dose of monetary stimulus, though that could also be complicated by signs of inflation heating up in the latest CPI and PPI prints. The big show: Fed Chair Jerome Powell is likely to share some of his thoughts on the matter this morning and what it might mean for the interest rate outlook and long-term policy goals. Wild trading can ensue following the closely watched event, like the notable Jackson Hole hangover of 2022, which saw all three of the major averages slump between 3%-4% after Powell shot down any hopes that the Fed would telegraph a pivot on its aggressive policy tightening. \"Equity markets, for its part, are entering this [year's] symposium near their highs, and stocks are largely priced for further confirmation of an easing in rates in September,\" SA Analyst Justin Purohit noted. \"That does leave investors vulnerable if Powell's speech underwhelms and delivers unexpected surprises.\" More on markets Fed's Next Move Should Be A Hike, And Not A Cut Walmart Earnings And Jackson Hole: Even The Wealthy Want 'Great Value' Bubble? Not So Fast, Mr. Altman Why tariff costs have not hit shoppers' wallets — yet Nine-month wait for Fed cut could lead to rally in S&P 500"
    },
    {
        "id": "4488231",
        "title": "ZKH Group Non-GAAP EPADS of -$0.03 in-line, revenue of $302.47M",
        "publishedDate": "2025-08-22 06:16:43",
        "url": "https://seekingalpha.com/news/4488231-zkh-group-non-gaap-epads-of-003-in-line-revenue-of-30247m",
        "content": "ZKH Group press release (NYSE:ZKH): Q2 Non-GAAP EPADS of -$0.03 in-line. Revenue of $302.47M, a decrease of 3.7% in the same period of 2024. Non-GAAP EBITDA was negative RMB38.7 million (US$5.4 million), compared with negative RMB47.1 million in the same period of 2024. Non-GAAP EBITDA margin was negative 1.8%, compared with negative 2.1% in the same period of 2024. More on ZKH Group Seeking Alpha’s Quant Rating on ZKH Group Historical earnings data for ZKH Group Financial information for ZKH Group"
    },
    {
        "id": "4488222",
        "title": "India, Russia to bolster trade ties despite Trump's ire over oil purchases",
        "publishedDate": "2025-08-22 05:59:43",
        "url": "https://seekingalpha.com/news/4488222-india-russia-to-bolster-trade-ties",
        "content": ""
    },
    {
        "id": "4488229",
        "title": "RLX Technology gives Q2 results",
        "publishedDate": "2025-08-22 05:49:43",
        "url": "https://seekingalpha.com/news/4488229-rlx-technology-gives-q2-results",
        "content": "RLX Technology press release (NYSE:RLX): Q2 GAAP EPADS of $0.03 beats by $0.01. Revenue of $122.8M (+42.3% Y/Y) beats by $22.31M. More on RLX Technology RLX Technology: A Rebounding Vape Giant With Global Ambitions And Undervalued Growth Seeking Alpha’s Quant Rating on RLX Technology Historical earnings data for RLX Technology Dividend scorecard for RLX Technology Financial information for RLX Technology"
    },
    {
        "id": "4488203",
        "title": "Nvidia chief praises TSMC, says buying its stock is 'very smart'",
        "publishedDate": "2025-08-22 05:46:30",
        "url": "https://seekingalpha.com/news/4488203-nvidia-chief-praises-tsmc-says-buying-its-stock-is-very-smart",
        "content": ""
    },
    {
        "id": "4488228",
        "title": "Biggest stock movers Friday: ZM, NIO, and more",
        "publishedDate": "2025-08-22 05:29:12",
        "url": "https://seekingalpha.com/news/4488228-biggest-stock-movers-friday-zm-nio-and-more",
        "content": "sankaiStock futures ticked higher on Friday as investors awaited Federal Reserve Chair Jerome Powell’s speech at Jackson Hole, looking for clues on the outlook for monetary policy. Here are some of Friday's biggest stock movers: Biggest stock gainers Zoom Communications (NASDAQ:ZM) +6% - Shares rose after delivering strong Q2 results and raising its full-year outlook. The company guided Q3 revenue to $1.21B–$1.22B (midpoint $1.215B vs. $1.21B est.) and EPS to $1.42–$1.44 (vs. $1.39 est.), while FY revenue was lifted to $4.83B–$4.84B (vs. prior $4.8B–$4.81B, $4.81B est.) and EPS to $5.81–$5.84 (vs. prior $5.56–$5.59, $5.60 est.). CEO Eric Yuan credited AI-driven innovation and efficiency gains, highlighting Zoom’s highest revenue growth in 11 quarters, a 9-pt GAAP operating margin expansion, and stronger free cash flow guidance of $1.74B–$1.78B. NIO (NYSE:NIO) +5% - Shares surged after the company unveiled one of its most affordable vehicles yet, highlighting the intensifying price war in the domestic market. The new ES8 is offered in six- and seven-seat Executive Premium and Executive Signature Editions with starting prices of RMB 416,800 (RMB 308,800 with BaaS) and RMB 456,800 (RMB 348,800 with BaaS). The base ES8 is priced below the Tesla (TSLA) Model Y L six-seat SUV, and in Europe the model will be marketed as the EL8 due to a trademark dispute with Audi. Biggest stock losers Intuit (NASDAQ:INTU) -5% - Shares slipped after issuing slower growth guidance for Q1 and FY2026, overshadowing better-than-expected Q4 results. The QuickBooks and Credit Karma parent sees FY2026 revenue of $21.0B-$21.2B, up 12%-13% from last year, roughly in line with consensus, and projects non-GAAP EPS of $22.98-$23.18 vs. $22.99 expected. By segment, Global Business Solutions revenue is forecast to rise 14%-15% from 16% in FY2025, Consumer Group up 8%-9% vs. 10%, and Credit Karma up 10%-13% vs. 32%. For fiscal Q1, Intuit guided EPS of $3.05-$3.12, bracketing the $3.07 consensus, on revenue growth of 14%-15% compared with 20% in Q4. Workday (NASDAQ:WDAY) -4% - Shares dropped after reporting fiscal Q2 results and guidance that exceeded expectations but failed to spark enthusiasm. For Q3, the company guided subscription revenue of $2.24B, in line with estimates, while FY2026 subscription revenue is projected at $8.82B, slightly above Wall Street’s $8.8B forecast. Workday also raised its adjusted operating margin outlook to 29% from 28%, topping both its prior view and the 28.5% consensus. Alongside results, the company announced an agreement to acquire Paradox, an AI-powered candidate experience platform. More on related stocks: Intuit Inc (INTU) Q4 2025 Earnings Call Transcript Zoom Communications Inc. 2026 Q2 - Results - Earnings Call Presentation Zoom Communications Inc. (ZM) Q2 2026 Earnings Call Transcript Intuit outlines 12–13% revenue growth target for fiscal 2026 as AI-driven platform gains momentum Zoom raises FY26 revenue outlook amid surging AI adoption and robust enterprise growth"
    },
    {
        "id": "4488226",
        "title": "Trump administration not seeking equity stakes in TSMC, Micron - report",
        "publishedDate": "2025-08-22 05:18:58",
        "url": "https://seekingalpha.com/news/4488226-trump-administration-not-seeking-equity-stakes-in-tsmc-micron---report",
        "content": "hapabapaThe Trump administration is weighing equity stakes in some companies receiving CHIPS Act funding but does not plan to seek stakes in major investors like TSMC (NYSE:TSM) and Micron (NASDAQ:MU), Reuters reported, citing a White House official. The official confirmed a Wall Street Journal report that the administration does not intend to seek stakes in semiconductor giants such as Micron (NASDAQ:MU) and TSMC (NYSE:TSM), which are significantly increasing U.S. investments. Earlier this week, U.S. Commerce Secretary Howard Lutnick said the government is considering a 10% stake in Intel (INTC) and could pursue similar deals with other grant recipients. “If we're going to give you the money, we want a piece of the action for the American taxpayer,” Lutnick told CNBC. While the Biden administration provided subsidies without equity, Lutnick added, “Donald Trump turned it into saying, ‘Hey, we want equity for the money.’” At a March event with President Trump at the White House, TSMC (TSM) — which counts Nvidia and Apple among its key clients — announced a $100 billion U.S. investment on top of $65 billion already committed for three Arizona plants. Micron (MU) also expanded its U.S. investment plans in June. TSMC executives have discussed returning subsidies if asked to offer equity stakes, the Wall Street Journal said. The Commerce Department finalized subsidies late last year of $4.75 billion for Samsung, $6.2 billion for Micron (MU), and $6.6 billion for TSMC (TSM) to expand semiconductor production in the U.S. Much of the $52.7 billion in CHIPS Act funding is yet to be disbursed. More on Taiwan Semiconductor Manufacturing Company, Micron Technology Micron: HBM Tailwinds Outweigh Margin Noise TSMC: Growth Outlook Remains Strong Is Intel The Next TSMC? Google's new Tensor G5 TPU will be made by Taiwan Semiconductor in change U.S. weighs equity stakes in chipmakers tied to CHIPS Act funding - report"
    },
    {
        "id": "4488225",
        "title": "Allison and Stagwell appoints industry veteran Margaret Key to lead Asia Pacific operations",
        "publishedDate": "2025-08-22 05:09:53",
        "url": "https://seekingalpha.com/news/4488225-allison-and-stagwell-appoints-industry-veteran-margaret-key-to-lead-asia-pacific-operations",
        "content": "Allison Worldwide and Stagwell (NASDAQ:STGW) has announced the appointment of veteran communications executive Margaret Key to a new dual role: CEO of Allison Asia and Executive Director of Asia Pacific for Stagwell. Starting October 1, Key will be based in Singapore and report to Allison Worldwide CEO Jonathan Heit. Most recently, she served as CEO for Publicis' MSL Group, Asia Pacific. More on Stagwell Stagwell Inc. 2025 Q2 - Results - Earnings Call Presentation Stagwell Inc. (STGW) Q2 2025 Earnings Call Transcript Stagwell: Connection With Large Brands, Digital Transformation Growth, And Cheap Stagwell Non-GAAP EPS of $0.17 beats by $0.01, revenue of $707M beats by $14.22M Seeking Alpha’s Quant Rating on Stagwell"
    },
    {
        "id": "4488200",
        "title": "Boeing St. Louis workers expect better deal, halting fighter jet production",
        "publishedDate": "2025-08-22 04:55:32",
        "url": "https://seekingalpha.com/news/4488200-boeing-st-louis-workers-expect-better-deal-halting-fighter-jet-production",
        "content": ""
    },
    {
        "id": "4488219",
        "title": "Starbucks seeks non-binding bids for China unit within two weeks - report",
        "publishedDate": "2025-08-22 04:54:25",
        "url": "https://seekingalpha.com/news/4488219-starbucks-seeks-non-binding-bids-for-china-unit-within-two-weeks---report",
        "content": "JohnFScott/iStock Unreleased via Getty ImagesStarbucks (NASDAQ:SBUX) has asked shortlisted bidders to submit non-binding offers for a stake in its China business within two weeks, Reuters reported, citing two sources. The company invited firms including Carlyle (CG), EQT (OTCPK:EQBBF), Hillhouse Investment and Primavera Capital to attend management presentations detailing financial and operational details of its China business, the sources said, adding that Tencent (OTCPK:TCEHY), KKR (KKR), and Bain Capital make up other potential bidders. Starbucks (NASDAQ:SBUX) reportedly began a formal sale process for its China unit in May, asking potential buyers to submit responses to a questionnaire. The company said at the time that it was not pursuing a full sale. In July, Starbucks shortlisted up to 10 bidders and signed NDAs before granting access to financial and operational data, sources said. The stake sale, expected to value the unit at up to $10 billion, aims to revive a business hit by slowing growth and rising competition from local rivals like Luckin Coffee (OTCPK:LKNCY). The coffee chain’s China market share fell to 14% last year from 34% in 2019, according to data from market researcher Euromonitor International. Starbucks (SBUX) has been in informal talks with potential buyers since late last year and is targeting a deal by year-end, sources previously told Reuters. CEO Brian Niccol said on last month’s earnings call that Starbucks has drawn interest from over 20 parties and is reviewing options. \"We remain committed to our China business and want to retain a meaningful stake... We will only enter a transaction if it makes sense for Starbucks,\" Niccol said. More on Starbucks Starbucks And McDonald's: Fast Food Giant Better Positioned Amid China Challenges Starbucks Stock Is Too Pricey For Its Performance: Time To Exit Starbucks: Buy Before Green Apron Gains Traction Starbucks testing healthier coconut-infused cold beverages Starbucks fires off a 2% pay raise to all salaried employees"
    },
    {
        "id": "4488224",
        "title": "OpenAI to establish 1st India office in New Delhi: report",
        "publishedDate": "2025-08-22 04:41:15",
        "url": "https://seekingalpha.com/news/4488224-openai-to-establish-1st-india-office-in-new-delhi",
        "content": "Justin Sullivan/Getty Images NewsMicrosoft (NASDAQ:MSFT)-backed OpenAI will open its first India office in New Delhi later this year, Reuters reported. OpenAI, which is aiming to push further in its second-largest market by user numbers, has been set up as a legal entity in India and has started hiring a local team, the report added. OpenAI did not immediately respond to a request for comment from Seeking Alpha. \"Opening our first office and building a local team is an important first step in our commitment to make advanced AI more accessible across the country and to build AI for India, and with India,\" said OpenAI's CEO Sam Altman in a statement to the news agency. Earlier this week, OpenAI launched its cheapest yet monthly plan in India for ChatGPT at 399 Indian rupees (under $5). India has the largest population of student users on ChatGPT, and weekly active users in the country have quadrupled in the past year, said OpenAI in newly shared market data, according to the report. OpenAI faces tough competition in India from competitors like Alphabet (GOOG) (GOOGL) unit Google's Gemini and AI startup Perplexity, both of which have launched services that make their advanced plans free for several users in the market. More on Microsoft Microsoft: On The Right Side Of The Generative AI War Against Software Microsoft Remains A Buy Near All-Time Highs Microsoft: Upside No Longer As Compelling Elon Musk, Mark Zuckerberg discussed potential financing of OpenAI takeover bid OpenAI's chief people officer steps down"
    },
    {
        "id": "4488218",
        "title": "Meta poaches another Apple AI executive amid talent exodus: report",
        "publishedDate": "2025-08-22 04:11:10",
        "url": "https://seekingalpha.com/news/4488218-meta-poaches-another-apple-ai-executive-amid-talent-exodus-report",
        "content": "Derick Hudson/iStock Editorial via Getty ImagesMeta Platforms (NASDAQ:META) is hiring another senior AI executive from Apple (NASDAQ:AAPL), even as it slows overall recruitment, Bloomberg reported, citing people familiar with the matter. Frank Chu, who led Apple AI teams for cloud infrastructure, training, and search, will join Meta’s Superintelligence Labs"
    },
    {
        "id": "4488208",
        "title": "Elon Musk, Mark Zuckerberg discussed potential financing of OpenAI takeover bid",
        "publishedDate": "2025-08-22 03:54:04",
        "url": "https://seekingalpha.com/news/4488208-elon-musk-openai-bid-meta-mark-zuckerberg",
        "content": ""
    },
    {
        "id": "4488220",
        "title": "5E Advanced Materials slips 13%, prices $8.3M stock offering",
        "publishedDate": "2025-08-22 03:34:00",
        "url": "https://seekingalpha.com/news/4488220-5e-advanced-materials-slips-13-prices-83m-stock-offering",
        "content": "Advanced Materials (NASDAQ:FEAM) priced its underwritten public offering of common stock in the U.S. 5E is selling ~2.37M shares of common stock at a public offering price of $3.50 per share. The gross proceeds to 5E from the offering are expected to be approximately $8.31M. The offering is expected to close on August 25, 2025. The stock price traded 13% lower on Thursday during after-market hours of trading. More on 5E Advanced Materials 5E Advanced Materials announces public offering Seeking Alpha’s Quant Rating on 5E Advanced Materials Historical earnings data for 5E Advanced Materials Financial information for 5E Advanced Materials"
    }
]